       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAY25.
      *DON'T FORGET TO :SET COLORCOLUMN=7,73 !
       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 INITIAL-EDGE-COUNT PIC 9(4).
      *    TOTAL WEIGHT OF ALL REMAINING EDGES. THIS IS INITIALLY EQUAL
      *    TO THE NUMBER OF EDGES, BUT DECREASES AS EDGES ARE REMOVED.
           01 TOTAL-WEIGHT PIC 9(4).

      *    BEWARE - TABLES ARE 1-INDEXED!
           01 EDGE-TABLE.
               03 EDGE-RECORD OCCURS 9999 TIMES INDEXED BY EDGE-INDEX.
                   05 FIRST-NODE PIC A(3).
                   05 SECOND-NODE PIC A(3).
                   05 EDGE-WEIGHT PIC 9(4).

      *    FOR EXAMPLE, THE LINE "ABC: DEF GHI"
      *    CREATES THE EDGES {"ABC" "DEF" 0001} AND {"ABC" "GHI" 0001}.


       PROCEDURE DIVISION.
           DISPLAY 'Hello, world!' END-DISPLAY.
           MOVE 1 TO EDGE-INDEX.
           MOVE "ABCDEF0001" TO EDGE-RECORD (1).
           DISPLAY EDGE-RECORD (EDGE-INDEX) END-DISPLAY.
           STOP RUN.
